#include<stdio.h>
int main() {
	//버블 정렬 - 인접한 요소와 비교해서 교환하여 정렬함
	//왼쪽이 작은 수, 오른쪽을 큰수로
	int a[5] = { 3,2,5,1,4 };
	int i, j, temp;  //temp - 교환을 위한 임시변수

	//for (i = 0; i < 5; i++) {
	//	for (j = 0; j < 4; j++) {
	//		if (a[j] > a[j+1]) {  //오름 차순
	//			temp = a[j];
	//			a[j] = a[j + 1];
	//			a[j + 1] = temp;
	//		}
	//	}
	//}
	///*		
	//*						3, 2, 5, 1, 4
	//	i = 0,  j = 1  3 > 2	2, 3, 5, 1, 4
	//			j = 2  2 > 5
	//			j = 3  2 > 1    1, 3, 5, 2, 4
	//			j = 4  1 > 4
	//	i = 1   j = 2  3 > 5   
	//			j = 3  3 > 2   1, 2, 5, 3, 4
	//			j = 4  2 > 4
	//	i = 2	j = 3  5 > 3   1, 2, 3, 5, 4
	//			j = 4  3 >
	//*/
	//for (int i = 0; i < 5; i++) {
	//	printf("%-2d", a[i]);
	//}
	/*printf("\n");*/

	//상태 변수 사용
	int sw = 0;   //교환 없음 = 0, 교환 있음 = 1
	for (i = 0; i < 5 - 1; i++) {
		for (j = 0; j < 5 - 1 - i; j++) {
			if (a[j] > a[j + 1]) {  //오름 차순
				temp = a[j];
				a[j] = a[j + 1];
				a[j + 1] = temp;
				sw = 1;  //교환 있음
			}
		}
	}
	if (!sw) {
		printf("이미 정렬 되어 있음\n");
	}

	for (int i = 0; i < 5; i++) {
		printf("%-2d", a[i]);
	}
	return 0;
}